package com.example.estsoft_udon_community.enums;

public enum LocationEnum {
    종로구, 중구, 용산구, 성동구, 광진구, 동대문구, 중랑구, 성북구, 강북구, 도봉구, 노원구, 은평구, 서대문구, 마포구, 양천구, 강서구, 구로구, 금천구, 영등포구, 동작구, 관악구, 서초구, 강남구, 송파구, 강동구,

    // 부산광역시
    부산중구, 부산서구, 부산동구, 영도구, 부산진구, 동래구, 남구, 북구, 해운대구, 사하구, 금정구, 부산강서구, 연제구, 수영구, 사상구, 기장군,

    // 대구광역시
    대구중구, 대구동구, 대구서구, 대구남구, 대구북구, 수성구, 달서구, 달성군, 군위군,

    // 인천광역시
    인천중구, 인천동구, 미추홀구, 연수구, 남동구, 부평구, 계양구, 인천서구, 강화군, 옹진군,

    // 광주광역시
    광주동구, 광주서구, 광주남구, 광주북구, 광산구,

    // 대전광역시
    대전동구, 대전중구, 대전서구, 유성구, 대덕구,

    // 울산광역시
    울산중구, 울산남구, 울산동구, 울산북구, 울주군,

    // 세종특별자치시
    세종시,

    // 경기도
    수원시, 고양시, 용인시, 성남시, 안산시, 안양시, 부천시, 화성시, 남양주시, 파주시, 김포시, 이천시, 평택시, 광명시, 오산시, 시흥시, 군포시, 의왕시, 하남시, 양주시, 구리시, 포천시, 연천군,

    // 강원특별자치도
    춘천시, 원주시, 강릉시, 동해시, 태백시, 속초시, 삼척시, 홍천군, 횡성군, 영월군, 평창군, 정선군, 철원군, 화천군, 양구군, 인제군, 고성군, 양양군,

    // 충청북도
    청주시, 충주시, 제천시, 진천군, 괴산군, 음성군, 단양군, 보은군, 영동군,

    // 충청남도
    천안시, 공주시, 보령시, 아산시, 서산시, 태안군, 당진시, 홍성군, 예산군, 서천군,

    // 전북특별자치도
    전주시, 익산시, 군산시, 정읍시, 남원시, 김제시, 완주군, 진안군, 무주군, 장수군, 임실군, 순창군, 고창군, 부안군
}